import ProfPicture from './Profile.png'
import myPDF from "../assets/Βιογραφικό.pdf";




const BioSection = () => {
  return (
    <div className="md:absolute relative  md:top-1/8  flex flex-col md:flex-row items-start gap-6 bg-gray-100/80">
      
      <div className="w-5/5  flex justify-center ">
        <img
          src={ProfPicture}
          alt="Bio"
          className="w-40 h-50 md:w-70 md:h-85 object-cover rounded-lg shadow-md"
        />
      </div>
    {/* Title */}
   

    <div className="flex flex-col md:flex-row items-start gap-6">
      
      {/* Image (Positioned between 10%-30% width) */}
      
        {/* Text Content */}
        <div className="w-full md:w-[80%] text-left md:text-lef ">
        <h2 className="text-3xl font-bold text-center mb-6  ">Βιογραφικό</h2>
          {/* First Paragraph */}
          <h3 className="text-xl font-semibold mb-2">Επαγγελματική Κατάρτιση</h3>
          <p className="text-gray-700 mb-4">
          Ως ψυχολόγος, η εκπαίδευσή μου έχει υπάρξει θεμελιώδης για την ανάπτυξη των δεξιοτήτων μου και την κατανόηση του ανθρώπινου ψυχισμού. Αποφοίτησα από το University of Sunderland στο Ηνωμένο Βασίλειο με πτυχίο στην Ψυχολογία (BSc), και στη συνέχεια συνέχισα τις σπουδές μου στο Keele University, όπου απέκτησα μεταπτυχιακό τίτλο στη Συμβουλευτική Ψυχολογία (MSc in Counselling Psychology). Μέσα από αυτό το μεταπτυχιακό πρόγραμμα, είχα την ευκαιρία να εξειδικευτώ στην προσωποκεντρική ψυχολογία, εμβαθύνοντας σε θεωρητικές και πρακτικές προσεγγίσεις που επικεντρώνονται στον άνθρωπο, την εμπιστοσύνη και την ανάπτυξη της θεραπευτικής σχέσης. Αυτή η προσέγγιση με βοήθησε να ενδυναμώσω την ικανότητά μου να προσφέρω ανοιχτό, ενσυναισθητικό και υποστηρικτικό περιβάλλον για όσους με εμπιστεύονται.
          </p><br/>
          <p className="text-gray-700 ">
          Για να ενισχύσω περαιτέρω τη γνώση μου στον τομέα της ψυχικής υγείας και της διοίκησης, απέκτησα μεταπτυχιακό τίτλο στο Frederick University στην Κύπρο, στον τομέα της Διοίκησης Μονάδων Υγείας και Υπηρεσιών (MSc Health Management). Επιπλέον, εξειδικεύτηκα στη Γνωστική Συμπεριφορική Θεραπεία Παιδιών και Εφήβων μέσω της Ελληνικής Εταιρείας Έρευνας Συμπεριφοράς, και έχω παρακολουθήσει σεμινάρια και επιμορφώσεις σε θέματα όπως η Πρόληψη και Διαχείριση Κακοποίησης Παιδιών, καθώς και η Σεξουαλική Κακοποίηση Παιδιών. Επιπλέον, η εξειδίκευσή μου στην κλίμακα WISC- V-GR για την αξιολόγηση νοημοσύνης σε παιδιά ενισχύει τη θεραπευτική μου προσέγγιση με παιδιά και εφήβους.
          </p>
          {/* Second Paragraph */}
          <br/><br/><br/><br/>
          <h3 className="text-xl font-semibold mb-2">Επαγγελματική Εμπειρία</h3>
          <p className="text-gray-700">
          Η επαγγελματική μου πορεία περιλαμβάνει ένα ευρύ φάσμα εμπειριών σε διάφορους τομείς της ψυχολογίας και της ψυχολογικής υποστήριξης. Από το 2024, παρέχω διαδικτυακή ψυχοθεραπεία μέσω της πλατφόρμας MyTherapist, προσφέροντας ατομική και οικογενειακή θεραπεία σε ενήλικες και ανήλικους, ενώ εξειδικεύομαι στην ψυχολογική υποστήριξη γονέων και ζευγαριών.
          </p><br/>
          <p className="text-gray-700">
          Επιπλέον, από το 2021, εργάζομαι στο Κέντρο Συμβουλευτικής και Θεραπείας Ευδοξία Αδαμίδου, όπου παρέχω ατομικές και ομαδικές συνεδρίες θεραπείας και διαγνωστική αξιολόγηση παιδιών, χρησιμοποιώντας την κλίμακα WISC-V-GR. Η εμπειρία μου στη Δευτεροβάθμια Εκπαίδευση (2020-2024), όπου εργάστηκα ως ψυχολόγος, με βοήθησε να παρέχω ψυχολογική υποστήριξη σε μαθητές, γονείς και διδάσκοντες και να αναπτύξω σχέδια δράσης για την ψυχοκοινωνική στήριξη της σχολικής κοινότητας κατά την πανδημία του COVID-19.
          </p><br/>
          <p className="text-gray-700">
          Πριν από αυτές τις θέσεις, εργάστηκα στο Κοινωνικό ΕΚΑΒ, παρέχοντας ψυχολογική υποστήριξη σε ασυνόδευτους ανηλίκους σε δομές φιλοξενίας, καθώς και στο ΚΔΗΦ &quot;Τα Παιδιά της Άνοιξης&quot;, όπου πρόσφερα θεραπευτική υποστήριξη σε άτομα με αναπηρία και οργάνωσα εκπαιδευτικές δραστηριότητες.
          </p><br/>
          <p className="text-gray-700">
          Η επαγγελματική μου πορεία με έχει καταστήσει ικανό να προσφέρω εξατομικευμένη, ευαίσθητη και αποτελεσματική ψυχολογική υποστήριξη, με στόχο την ενίσχυση της ψυχικής υγείας των ατόμων που απευθύνονται σε μένα για βοήθεια.
          </p><br/><br/><br/>

            <div className="flex justify-center items-center h-10vh">
          
              <a
                href={myPDF} // Use the imported file path
                target="_blank"
                rel="noopener noreferrer"
                className="bg-teal-400 text-white font-semibold py-3 px-6 rounded-lg shadow-md transition duration-300 hover:bg-teal-500  "
              >
                Αναλυτικό Βιογραφικό
              </a>
              
        </div>
        </div>
        
      </div>

       
    </div>
  );
};

export default BioSection;